DataProcessors/Лео_ВыгрузкаСвойствНоменклатуры/Лео_ВыгрузкаСвойствНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Лео_ВыгрузкаСвойствНоменклатуры</name>
  <attributes>
    <name>ПутьКФайлу</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <comment>(Общ) Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>(Общ) Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Весовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициентВхождения</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВестиОперативныйУчетОстатковНЗП</name>
    <comment>(Упр)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПартионныйУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериям</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоСериямВНЗП</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиУчетПоХарактеристикам</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВоспроизводства</name>
    <comment>(Упр)</comment>
    <type>
      <types>EnumRef.ВидыВоспроизводстваНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаДляОтчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаХраненияОстатков</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>БазоваяЕдиницаИзмерения</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Набор</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеИспользования</name>
    <type>
      <types>CatalogRef.НазначенияИспользования</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <comment>(Общ) Ставка НДС по умолчанию для оформления документов</comment>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйМенеджерЗаПокупки</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.КлассификаторСтранМира</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>CatalogRef.НомераГТД</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнешняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяВнутренняяСертификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиСерийныеНомера</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комплект</name>
    <comment>(Общ)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеВыпуска</name>
    <type>
      <types>EnumRef.НаправленияВыпуска</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеСписанияВыпущеннойПродукции</name>
    <type>
      <types>CatalogRef.НаправленияСписанияВыпущеннойПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокПрисвоенияСерийногоНомера</name>
    <type>
      <types>CatalogRef.ПорядокПрисвоенияСерийныхНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦеноваяГруппа</name>
    <type>
      <types>CatalogRef.ЦеновыеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОКП</name>
    <comment>Общероссийский классификатор продукции</comment>
    <type>
      <types>CatalogRef.ОбщероссийскийКлассификаторПродукции</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмеренияМест</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатуры</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительноеОписаниеНоменклатурыВФорматеHTML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СтатусНоменклатуры</name>
    <type>
      <types>EnumRef.абс_СтатусыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_РотацияНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_НеИспользоватьПриПодборе</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТУ</name>
    <type>
      <types>CatalogRef.Лео_ТехническиеУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ТипУпаковки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ОрганолептическиеПоказатели</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказателиБезопасности</name>
    <type>
      <types>EnumRef.Лео_ОКК_СоответствиеПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ФормаВыпуска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ВнешнийВид</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОКК_ПоказательЭффективности</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_ИмяСпец</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ОперативныйСтатусНоменклатуры</name>
    <type>
      <types>CatalogRef.Лео_ОперативныйСтатусНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_ДопДанные</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>лео_белки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_жиры</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_углеводы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>лео_КК</name>
    <comment>Энергетическая ценность</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Аллерген</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_АдресХранения</name>
    <type>
      <types>CatalogRef.Лео_АдресаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_РодительНоменклатуры</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_НоменклатураДляЗамены</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СДИЗ</name>
    <comment>сопроводительный документ по идентификации зерна</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Замес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_АртикулыПокупателя</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>АртикулПокупателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>15</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Catalogs/ЕдиницыИзмерения/ЕдиницыИзмерения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЕдиницыИзмерения</name>
  <comment>(Общ)</comment>
  <owners>Catalog.Номенклатура</owners>
  <owners>Catalog.НоменклатурныеГруппы</owners>
  <attributes>
    <name>ЕдиницаПоКлассификатору</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Вес</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВесНетто</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объем</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>18</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коэффициент</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредупреждатьОНецелыхМестах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_Высота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Глубина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_Ширина</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЛинейныеРазмерыПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_РазрешатьДробноеКоличествоМест</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ТипУпаковки</name>
    <type>
      <types>CatalogRef.Лео_ТипУпаковки</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ЧистыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DataProcessors/Лео_ВыгрузкаСвойствНоменклатуры/Forms/Форма/Module.bsl
&НаКлиенте
Процедура ПоказатьВыгрузку(Команда)
	Запрос = ПолучитьЗапрос ();
	Результат = Запрос.Выполнить();
    ТабДокумент = Новый ТабличныйДокумент;
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(Результат);       
	Построитель.Вывести(ТабДокумент);
    ТабДокумент.Показать();
КонецПроцедуры

&НаКлиенте
Функция ПолучитьЗапрос ()
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//{Лео Катанович 
	//БЫЛО
		//"ВЫБРАТЬ
		//|	Номенклатура.Ссылка КАК Номенклатура,
		//|	Номенклатура.Код,
		//|	Номенклатура.Артикул,
		//|	Номенклатура.НаименованиеПолное,
		//|	Номенклатура.Наименование,
		//|	Номенклатура.абс_СтатусНоменклатуры
		//|ПОМЕСТИТЬ ВТ_Номенклатура
		//|ИЗ
		//|	Справочник.Номенклатура КАК Номенклатура
		//|ГДЕ
		//|	Номенклатура.Артикул <> """"
		//|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЗначенияСвойствОбъектов.Объект,
		//|	ЗначенияСвойствОбъектов.Свойство,
		//|	ЗначенияСвойствОбъектов.Значение
		//|ПОМЕСТИТЬ ВТ_Свойства
		//|ИЗ
		//|	ВТ_Номенклатура КАК ВТ_Номенклатура
		//|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
		//|		ПО ВТ_Номенклатура.Номенклатура = ЗначенияСвойствОбъектов.Объект
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВТ_Номенклатура.Код,
		//|	ВТ_Номенклатура.Артикул,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Тип) КАК Тип,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Категория) КАК Категория,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Подкатегория1) КАК Подкатегория1,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Подкатегория2) КАК Подкатегория2,
		//|	МАКСИМУМ(СвойстваНоменклатуры.ТорговаяМарка) КАК ТорговаяМарка,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Название) КАК Название,
		//|	ВТ_Номенклатура.Наименование,
		//|	ВЫРАЗИТЬ(ВТ_Номенклатура.НаименованиеПолное КАК СТРОКА(500)) КАК НаименованиеПолное,
		//|	ВТ_Номенклатура.абс_СтатусНоменклатуры,
		//|	ЕСТЬNULL(ВложенныйЗапрос.Коэффициент, 1) * ВТ_Номенклатура.Номенклатура.ЕдиницаХраненияОстатков.ВесНетто КАК Вес,
		//|	"""" КАК Прейскурант,
		//|	МАКСИМУМ(СвойстваНоменклатуры.ФокусныйАссортимент) КАК ФокусныйАссортимент,
		//|	МАКСИМУМ(ЕСТЬNULL(ВложенныйЗапрос.Коэффициент, 1)) КАК КолВложений,
		//|	МАКСИМУМ(ВТ_Номенклатура.Номенклатура.ЕдиницаХраненияОстатков.ВесНетто) КАК ВесВложения,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Одиночные) КАК Одиночные,
		//|	МАКСИМУМ(СвойстваНоменклатуры.ФорматУпаковки) КАК ФорматУпаковки,
		//|	МАКСИМУМ(СвойстваНоменклатуры.СводноеНаименование) КАК СводноеНаименование,
		//|	МАКСИМУМ(СвойстваНоменклатуры.СводнаяТорговаяМарка) КАК СводнаяТорговаяМарка,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Consumer_product) КАК Consumer_product,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Потребление) КАК Потребление,
		//|	МАКСИМУМ(СвойстваНоменклатуры.Новинка) КАК Новинка,
		//|	МАКСИМУМ(СвойстваНоменклатуры.КоличествоВложенийМаркетинг) КАК КоличествоВложенийМаркетинг,
		//|	МАКСИМУМ(СвойстваНоменклатуры.ВесВложенияМаркетинг) КАК ВесВложенияМаркетинг,
		//|	МАКСИМУМ(СвойстваНоменклатуры.ВесМаркетинг) КАК ВесМаркетинг
		//|ИЗ
		//|	ВТ_Номенклатура КАК ВТ_Номенклатура
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ВТ_Свойства.Объект КАК Объект,
		//|			ВТ_Свойства.Значение КАК Тип,
		//|			"""" КАК Категория,
		//|			"""" КАК Подкатегория1,
		//|			"""" КАК Подкатегория2,
		//|			"""" КАК ТорговаяМарка,
		//|			"""" КАК ФокусныйАссортимент,
		//|			"""" КАК ФорматУпаковки,
		//|			"""" КАК СводноеНаименование,
		//|			"""" КАК Consumer_product,
		//|			"""" КАК Потребление,
		//|			"""" КАК Название,
		//|			"""" КАК ВесВложения,
		//|			"""" КАК Одиночные,
		//|			"""" КАК Новинка,
		//|			"""" КАК КоличествоВложенийМаркетинг,
		//|			"""" КАК ВесВложенияМаркетинг,
		//|			"""" КАК ВесМаркетинг,
		//|			"""" КАК СводнаяТорговаяМарка
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Тип
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Категория
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Подкатегория1
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Подкатегория2
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &ТорговаяМарка
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &ФокусныйАссортимент
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &ФорматУпаковки
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &СводноеНаименование
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Consumer_product
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Потребление
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Название
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &ВесВложения
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Одиночные
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &Новинка
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &КоличествоВложенийМаркетинг
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			"""",
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &ВесВложенияМаркетинг
		//|		
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение,
		//|			""""
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &ВесМаркетинг
		//
		//|		ОБЪЕДИНИТЬ ВСЕ
		//|		
		//|		ВЫБРАТЬ
		//|			ВТ_Свойства.Объект,
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			"""",
		//|			ВТ_Свойства.Значение
		//|		ИЗ
		//|			ВТ_Свойства КАК ВТ_Свойства
		//|		ГДЕ
		//|			ВТ_Свойства.Свойство = &СводнаяТорговаямарка) КАК СвойстваНоменклатуры
		//
		//|		ПО ВТ_Номенклатура.Номенклатура = СвойстваНоменклатуры.Объект
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			ЕдиницыИзмерения.Ссылка КАК Ссылка,
		//|			ЕдиницыИзмерения.Владелец КАК Владелец,
		//|			ЕдиницыИзмерения.Коэффициент КАК Коэффициент
		//|		ИЗ
		//|			Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		//|		ГДЕ
		//|			ЕдиницыИзмерения.Наименование = ""Блок""
		//|			И ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
		//|		ПО ВТ_Номенклатура.Номенклатура = ВложенныйЗапрос.Владелец
		//|
		//|СГРУППИРОВАТЬ ПО
		//|	ВТ_Номенклатура.Код,
		//|	ВТ_Номенклатура.Наименование,
		//|	ВЫРАЗИТЬ(ВТ_Номенклатура.НаименованиеПолное КАК СТРОКА(500)),
		//|	ВТ_Номенклатура.абс_СтатусНоменклатуры,
		//|	ВТ_Номенклатура.Артикул,
		//|	ЕСТЬNULL(ВложенныйЗапрос.Коэффициент, 1) * ВТ_Номенклатура.Номенклатура.ЕдиницаХраненияОстатков.ВесНетто";
    Запрос.Текст = 
	    "ВЫБРАТЬ
	    |	Номенклатура.Ссылка КАК Номенклатура,
	    |	Номенклатура.Ссылка.Артикул КАК Артикул
	    |ПОМЕСТИТЬ ВТ_Номенклатура
	    |ИЗ
	    |	Справочник.Номенклатура КАК Номенклатура
	    |ГДЕ
	    |	Номенклатура.Артикул <> """"
	    |	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	    |;
	    |
	    |////////////////////////////////////////////////////////////////////////////////
	    |ВЫБРАТЬ
	    |	ВТ_Номенклатура.Номенклатура.Код КАК Код,
	    |	ВТ_Номенклатура.Номенклатура.Артикул КАК Артикул,
		
		|	ВТ_Номенклатура.Номенклатура.Наименование КАК Наименование,
		|	ВТ_Номенклатура.Номенклатура.НаименованиеПолное КАК НаименованиеПолное,
		|	ВТ_Номенклатура.Номенклатура.абс_СтатусНоменклатуры КАК СтатусНоменклатуры,
        |   ЕСТЬNULL(ВложенныйЗапрос.Коэффициент, 1) * ВТ_Номенклатура.Номенклатура.ЕдиницаХраненияОстатков.ВесНетто КАК Вес,
		|	ВТ_Номенклатура.Номенклатура.ЕдиницаХраненияОстатков.ВесНетто КАК ВесВложения,
		|	"""" КАК Прейскурант,
		|	ТипСвойство.Значение КАК Тип,
	    |	Категория.Значение КАК Категория,
	    |	ПодКатегория1.Значение КАК ПодКатегория1,
	    |	ПодКатегория2.Значение КАК ПодКатегория2,
	    |	ТорговаяМарка.Значение КАК ТорговаяМарка,
	    |	СводнаяТорговаяМарка.Значение КАК СводнаяТорговаяМарка,
	    |	ФокусныйАссортимент.Значение КАК ФокусныйАссортимент,
	    |	СводноеНаименование.Значение КАК СводноеНаименование,
	    |	Название.Значение КАК Название,
	    |	Consumer_Product.Значение КАК Consumer_Product,
	    |	Потребление.Значение КАК Потребление,
	    |	Одиночные.Значение КАК Одиночные,
	    |	Новинка.Значение КАК Новинка,
	    |	ФорматУпаковки.Значение КАК ФорматУпаковки,
		|	ЕСТЬNULL(ВложенныйЗапрос.Коэффициент, 1) КАК КолВложений,
	    |	КоличествоВложенийМаркетинг.Значение КАК КоличествоВложенийМаркетинг,
	    //|	ВесВложения.Значение КАК ВесВложения,
	    |	ВесВложенияМаркетинг.Значение КАК ВесВложенияМаркетинг,
	    |	ВесМаркетинг.Значение КАК ВесМаркетинг
	    |ИЗ
	    |	ВТ_Номенклатура КАК ВТ_Номенклатура
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ВесВложенияМаркетинг) КАК ВесВложенияМаркетинг
	    |		ПО ВТ_Номенклатура.Номенклатура = ВесВложенияМаркетинг.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &Тип) КАК ТипСвойство
	    |		ПО ВТ_Номенклатура.Номенклатура = ТипСвойство.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &Категория) КАК Категория
	    |		ПО ВТ_Номенклатура.Номенклатура = Категория.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ПодКатегория1) КАК ПодКатегория1
	    |		ПО ВТ_Номенклатура.Номенклатура = ПодКатегория1.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ПодКатегория2) КАК ПодКатегория2
	    |		ПО ВТ_Номенклатура.Номенклатура = ПодКатегория2.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ТорговаяМарка) КАК ТорговаяМарка
	    |		ПО ВТ_Номенклатура.Номенклатура = ТорговаяМарка.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &СводнаяТорговаяМарка) КАК СводнаяТорговаяМарка
	    |		ПО ВТ_Номенклатура.Номенклатура = СводнаяТорговаяМарка.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ФокусныйАссортимент) КАК ФокусныйАссортимент
	    |		ПО ВТ_Номенклатура.Номенклатура = ФокусныйАссортимент.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ФорматУпаковки) КАК ФорматУпаковки
	    |		ПО ВТ_Номенклатура.Номенклатура = ФорматУпаковки.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &СводноеНаименование) КАК СводноеНаименование
	    |		ПО ВТ_Номенклатура.Номенклатура = СводноеНаименование.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &Consumer_Product) КАК Consumer_Product
	    |		ПО ВТ_Номенклатура.Номенклатура = Consumer_Product.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &Потребление) КАК Потребление
	    |		ПО ВТ_Номенклатура.Номенклатура = Потребление.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &Название) КАК Название
	    |		ПО ВТ_Номенклатура.Номенклатура = Название.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ВесВложения) КАК ВесВложения
	    |		ПО ВТ_Номенклатура.Номенклатура = ВесВложения.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &Одиночные) КАК Одиночные
	    |		ПО ВТ_Номенклатура.Номенклатура = Одиночные.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &Новинка) КАК Новинка
	    |		ПО ВТ_Номенклатура.Номенклатура = Новинка.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &КоличествоВложенийМаркетинг) КАК КоличествоВложенийМаркетинг
	    |		ПО ВТ_Номенклатура.Номенклатура = КоличествоВложенийМаркетинг.Объект
	    |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	    |			ЗначенияСвойствОбъектов.Объект КАК Объект,
	    |			ЗначенияСвойствОбъектов.Свойство КАК Свойство,
	    |			ЗначенияСвойствОбъектов.Значение КАК Значение
	    |		ИЗ
	    |			РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	    |		ГДЕ
	    |			ЗначенияСвойствОбъектов.Свойство = &ВесМаркетинг) КАК ВесМаркетинг
	    |		ПО ВТ_Номенклатура.Номенклатура = ВесМаркетинг.Объект
		|       ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			ЕдиницыИзмерения.Ссылка КАК Ссылка,
		|			ЕдиницыИзмерения.Владелец КАК Владелец,
		|			ЕдиницыИзмерения.Коэффициент КАК Коэффициент
		|		ИЗ
		|			Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|		ГДЕ
		|			ЕдиницыИзмерения.Наименование = ""Блок""
		|			И ЕдиницыИзмерения.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
		|		ПО ВТ_Номенклатура.Номенклатура = ВложенныйЗапрос.Владелец

	    |
	    |УПОРЯДОЧИТЬ ПО
	    |	Код"    ;
 //Лео Катанович}	
	Запрос.УстановитьПараметр("Тип", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ТипНоменклатуры);
	Запрос.УстановитьПараметр("Категория", ПланыВидовХарактеристик.СвойстваОбъектов.абс_КатегорияНоменклатуры);
    Запрос.УстановитьПараметр("Подкатегория1", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Подкатегория1);
    Запрос.УстановитьПараметр("Подкатегория2", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Подкатегория2);
    Запрос.УстановитьПараметр("ТорговаяМарка", ПланыВидовХарактеристик.СвойстваОбъектов.ТорговаяМарка);
    Запрос.УстановитьПараметр("ФокусныйАссортимент", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ФокусныйАссортимент);
    Запрос.УстановитьПараметр("ФорматУпаковки", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ФорматУпаковки);
    Запрос.УстановитьПараметр("СводноеНаименование", ПланыВидовХарактеристик.СвойстваОбъектов.абс_СводноеНаименование);
	Запрос.УстановитьПараметр("СводнаяТорговаяМарка", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000067"));
	Запрос.УстановитьПараметр("Consumer_product", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ConsumerProduct);
    Запрос.УстановитьПараметр("Потребление", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Потребление);
	Запрос.УстановитьПараметр("Название", ПланыВидовХарактеристик.СвойстваОбъектов.абс_НазваниеНоменклатуры);
	Запрос.УстановитьПараметр("ВесВложения", ПланыВидовХарактеристик.СвойстваОбъектов.абс_ВесВложения);
    Запрос.УстановитьПараметр("Одиночные", ПланыВидовХарактеристик.СвойстваОбъектов.абс_Одиночные);
	Запрос.УстановитьПараметр("Новинка", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000051"));
    Запрос.УстановитьПараметр("КоличествоВложенийМаркетинг", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000052"));
	Запрос.УстановитьПараметр("ВесВложенияМаркетинг", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000053"));
	Запрос.УстановитьПараметр("ВесМаркетинг", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000054"));
	//Запрос.УстановитьПараметр("КоличествоВложений", ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоКоду("00000000054"));

	
	Возврат Запрос;
КонецФункции

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	Попытка 
		Запрос = ПолучитьЗапрос ();
		Результат = Запрос.Выполнить();
	    ТабДокумент = Новый ТабличныйДокумент;
		Построитель = Новый ПостроительОтчета;
		Построитель.ИсточникДанных=Новый ОписаниеИсточникаДанных(Результат);       
		Построитель.Вывести(ТабДокумент);

		
		ИмяДокумента = "Nomenklatura_" + Формат(ДобавитьМесяц(ТекущаяДата(),-2), "ДФ=yyyyMM")+ ".xls";
		ТабДокумент.Записать(Объект.ПутьКФайлу+ ИмяДокумента,ТипФайлаТабличногоДокумента.XLS);
		
		Сообщить("Файл " + ИмяДокумента + " сформирован." )
	Исключение
		Сообщить("Не удалось сформировать файл." )
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
    Если Диалог.Выбрать() Тогда
        Объект.ПутьКФайлу = Диалог.Каталог + "\";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ПутьКФайлу =  "\\air\Sales\Cube\1С\"  ;
КонецПроцедуры
